let vortaro = `a ตัวลงท้ายค าคุณศัพท์
al (บ.) ถึง, ไปยัง
aparteni (อก.) เป็นของ
as ตัวลงท้ายกริยาปัจจุบันกาล
besto สัตว์
birdo นก
brili (อก.) ส่องแสง
esti (อก.) เป็น, อย,ู่ คือ
floro ดอกไม้
frato พี่ชาย, น้องชาย
kaj (สัน.) และ
kolombo นกพิราบ
la คา นา หนา้นามช้ีเฉพาะ
leono สิงโต
o ตัวลงท้ายคำนาม
patro พอ่
rozo ดอกกุหลาบ
sana สุขภาพดี
suno พระอาทิตย์
tajloro ช่างตดัเส้ือ
― - เครื่องหมาย ―
Teodoro ชื่อคน เธโอดอร์

blua สีน้า เงิน
ĉielo ท้องฟ้า
fenestro หนา้ต่าง
homo มนุษย์, คน
infano เด็ก
is ตัวลงท้ายของกริยาอดีตกาล
jam แล้ว
jen นี่
kie (ว.ค ําถําม) ที่ไหน, (ช.) ที่ซึ่ง
kiu (ส.ค ําถําม) ใคร, (ค.ค ําถําม), คน/อันไหน, ... ไหน (ช.) ซ่ึงเป็นสิ่งที่, ซึ่งเป็นผู้ที่
kiun ซึ่งเป็นสิ่งที่, ซึ่งเป็นผู้ที่
krajono ดินสอ
kuŝi (อก.) นอน (ท่าทาง), วาง
libro หนังสือ
matura เติบโตเต็มที่
mi ผม, ดิฉัน (สรรพนามบุรุษที่ 1
เอกพจน์)
n ตัวลงท้ายกรรมตรง
ne ไม่
plori (อก.) ร้องไห้
plumo ปากกา
pomo ผลแอปเปิ้ล
sur (บ.) อยดู่ า้นบน, บน
ŝtono กอ้นหิน
tablo โต๊ะ
tero โลก, แผน่ ดิน
trovi (สก.) พบ (บางอยา่ ง)

akra คม
danĝero อันตราย
de (บ.) ของ, จาก
dento ฟัน
e ตัวลงท้ายกริยาวิเศษณ์(บ่งช้ี
ลักษณะของกริยา “อย่ําง....”, ขยายคุณศัพท์, หรือขยายท้งัประโยค)
doni (สก.) ให้
forta แข็งแรง
i ตวัลงทา้ยกริยาไม่แสดงกาล (กริยาสภาวมาลา)
j ตัวลงท้ายของค าพหูพจน์
kun (สัน.) กบั
kuraĝa กล้าหาญ
mano มือ
paroli (สก.) พูด
pri (บ.) เกี่ยวกบั
rajdi (อก.) ขี่, ขับขี่
resti (อก.) พกัผอ่ น, พักอาศัย
u ตวัลงทา้ยกริยาแสดงคา สงั่ หรือการขอร้อง
vidi (สก.) เห็น, พบ(เห็น)

ami (สก.) รัก
antaŭ (บ.) ข้างหน้า
apud (บ.) ข้าง ๆ
arbo ต้นไม้
bona ดี
buŝo ปาก
ĉambro ห้อง
ĉapelo หมวก
diligenta ขยัน
diri (สก.) บอก
domo บ้าน
filo ลูกชาย

flari (สก.) ดม
ke วา่ , ที่ (เริ่มอนุประโยค)
koni (สก.) รู้จัก
kune ดว้ยกนั
manĝi (สก.) กิน, รับประธาน
nazo จมูก
pano ขนมปัง
per (บ.) โดย
pura สะอาด
stari (อก.) ยืน
veni (อก.) มา

agrabla เพลิดเพลินใจ
akvo น้า
aŭdi (สก.) ได้ยิน
avo ปู่, ตา
bati (สก.) ตี
ĉar (สัน.) เพราะวา่
flugi (อก.) บิน
for (บ.) ไกล
ili พวกเขา, พวกหล่อน, พวกมัน (สรรพนามบุรุษที่ 3 พหูพจน์)
iri (อก.) ไป
kanti (อก.) ร้องเพลง
knabo เด็กชาย
legi (สก.) อ่าน
lerni (สก.) เรียน
letero จดหมาย
li เขา (สรรพนาบุรุษที่ 3 เอกพจน์เพศชาย )
ni พวกเรา (สรรพนามบุรุษที่ 1 พหูพจน์)
nun (ว.) ตอนน้ี
okulo ดวงตา
onklo ลุง, น้า
orelo หู
peli (สก.) ไล่, ต้อน
ricevi (สก.) รับ
sed (สัน.) แต่
skribi (สก.) เขียน
tial (ว.) เหตุน้นั
trinki (สก.) ดื่ม
voli (สก.) ต้องการ

amiko เพื่อน
bela สวย, หล่อ
blanka สีขาว
ĉiu (ค.) แต่ละ..., ทุก ๆ ... (ส.) แต่ละคน/สิ่ง (ĉiuj (ค.) ทุก...,(ส.) ท้งัหมด, ทุกคน)
deziri (สก.) ปรารถนา
dolĉa หวาน
el (บ.) จาก
en (บ.) ใน
erari (อก.) ท าผิด
festi (สก.) ฉลอง

fraŭlo นาย (ชายโสด)
fraŭlino นางสาว
freŝa สด
ĝoji (อก.) มีความสุข
havi (สก.) มี
hela สวา่ ง
historio ประวัติศาสตร์
hodiaŭ (ว.) วนั น้ี
in ตัวเติมท้ายแสดงเพศหญิงpatro
พอ่ ― patrino แม่
juna อ่อนวยั, วยัรุ่น
kajero สมุด

kia (ค.ค ําถําม) ชนิดใด, ลักษณะแบบใด, (ช.) ซึ่งเป็นลักษณะที่, (ค.)เป็นค าใช้ร่วมแสดงการอุทาน
kiel (ว.ค ําถําม) วิธีใด, อยา่ งไร (ช.) เหมือน, ดงั่
lakto น้า นม
luno ดวงจันทร์
mal ตัวเติมหน้าแสดงความหมายตรงข้าม bona ดี―malbona ชวั่ ; estimiเคารพ, นับถือ ― malestimi ดูหมิ่น
mateno เช้า
mia ของฉัน
neĝo หิมะ
nokto กลางคืน
nutri (สก.) ให้อาหาร, หล่อเล้ียง
obstina หวัด้ือ
ol กวา่ (สันธานของการเปรียบเทียบ)

pala สีซีด
papero กระดาษ
plej (ว.) ...ที่สุด, ...มากที่สุด
pli (ว.) ...กวา่ , ...มากวา่
rakonti (สก.) เล่า (เรื่องราว)
saĝa ฉลาด
si เขาเอง, หล่อนเอง, มันเอง; พวกเขาเอง, พวกมันเอง (สรรพนามสะท้อนบุรุษที่ 3 ท้งัเอกพจน์และพหูพจน์) (siaของเขาเอง, ของหล่อนเอง,ของมันเอง; ของพวกเขาเอง,ของพวกหล่อนเอง, ของพวกมันเอง)
sinjoro ท่านสุภาพบุรุษ, นาย
stelo ดวงดาว
tago วัน
tiel (ว.) วธิีน้นั , อยา่ งน้นั
vi คุณ, พวกคุณ (สรรพนามบุรุษที่ 2 เอกพจน์, พหูพจน์)
vino ไวน์
`;